app/Models/TaskModel.php

    public function getTasksByDate(?string $date = null): array
    {
        $date = $date ?? date('Y-m-d');

        return $this->where('task_date', $date)
                    ->orderBy('created_at', 'ASC')
                    ->findAll();
---
SELECT *
FROM `tasks`
WHERE `task_date` = '2026-09-27'
ORDER BY `created_at` ASC